* Standard Select and update queries
:PROPERTIES:
:header-args:http: :host http://localhost:8081 :user admin:quinnisgreat
:header-args:sparqlx: :url http://sparql.org/sparql :format text/csv
:header-args:sparql: :url http://localhost:8081/experts/sparql :format text/csv
:END:

This file is meant to be something of a literate programming environment for a
standard set of sparql queries.  Eventually, this will be moved to the ~aeq~
prioject for a single point of entry for queries to the system.  This should be
an interactive file, that you can use to test queries, and then untangle this
file, once you are ready to save these particular queries.

This [[https://www.gnu.org/software/emacs/refcards/pdf/orgcard.pdf][Shortcut]] list is helpful to remember things like how to show the composed
query.  This standard org-mode page on the [[https://orgmode.org/manual/Environment-of-a-Code-Block.html][Environment of a
Code Block]] is also handy.

This uses [[https://github.com/ljos/sparql-mode][sparql-mode]] which is actually pretty nice for queries.  For updates,
I'm starting to look into the [[https://github.com/federicotdn/verb/blob/master/README.md][verb]] package, which might be the best for org-mode
interaction.

** Prefixes

These are the Aggie Experts semi official prefixes.

#+name: prefixes
#+BEGIN_SRC sparql :no-tangle
PREFIX aeq: <http://experts.ucdavis.edu/queries/schema#>
PREFIX authorship: <http://experts.ucdavis.edu/authorship/>
PREFIX bibo: <http://purl.org/ontology/bibo/>
PREFIX bind: <http://experts.ucdavis.edu/schema/bind/>
PREFIX experts: <http://experts.library.ucdavis.edu/>
PREFIX experts: <http://experts.ucdavis.edu/>
PREFIX experts_iam: <http://experts.ucdavis.edu/iam/>
PREFIX experts_oap: <http://experts.ucdavis.edu/oap/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX harvest_iam: <http://iam.ucdavis.edu/>
PREFIX harvest_oap: <http://oapolicy.universityofcalifornia.edu/>
PREFIX iam: <http://iam.ucdavis.edu/schema#>
PREFIX oap: <http://oapolicy.universityofcalifornia.edu/vocab#>
PREFIX obo: <http://purl.obolibrary.org/obo/>
PREFIX person: <http://experts.ucdavis.edu/person/>
PREFIX purl: <http://purl.org/ontology/bibo/>
PREFIX q: <http://experts.ucdavis.edu/queries/>
PREFIX query: <http://experts.ucdavis.edu/schema/queries/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX ucdrp: <http://experts.ucdavis.edu/schema#>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>
PREFIX vivo: <http://vivoweb.org/ontology/core#>
PREFIX work: <http://experts.ucdavis.edu/work/>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
#+END_SRC

** Describe
:PROPERTIES:
:header-args:sparql: :url http://localhost:8081/experts/sparql :format raw :wrap SRC ttl
:END:

The most simple and useful query uses the describe function.  It's also a good
introduction to using the parameter matching on our files.

#+name: describe
#+BEGIN_SRC sparql :format raw :noweb yes :var uri="ucdrp:null"
<<prefixes>>
  describe ?uri
#+END_SRC

#+name: describe_hashed
#+BEGIN_SRC sparql :format raw :noweb yes :var uri="work:3266506"
<<prefixes>>
describe ?s where {
 ?s ?p ?o.
 filter(isiri(?s))
 filter(regex(str(?s),concat("^",str(?uri),"#?")))
}
#+END_SRC

Now, we can use this function to describe any particular subject in the database.

#+call: describe_hashed(uri="authorship:3266506-3")

#+RESULTS:
#+BEGIN_SRC ttl
@prefix experts_oap: <http://experts.ucdavis.edu/oap/> .
@prefix xsd:   <http://www.w3.org/2001/XMLSchema#> .
@prefix skos:  <http://www.w3.org/2004/02/skos/core#> .
@prefix rdfs:  <http://www.w3.org/2000/01/rdf-schema#> .
@prefix ucdrp: <http://experts.ucdavis.edu/schema#> .
@prefix purl:  <http://purl.org/ontology/bibo/> .
@prefix aeq:   <http://experts.ucdavis.edu/queries/schema#> .
@prefix bind:  <http://experts.ucdavis.edu/schema/bind/> .
@prefix iam:   <http://iam.ucdavis.edu/schema#> .
@prefix authorship: <http://experts.ucdavis.edu/authorship/> .
@prefix vivo:  <http://vivoweb.org/ontology/core#> .
@prefix harvest_iam: <http://iam.ucdavis.edu/> .
@prefix foaf:  <http://xmlns.com/foaf/0.1/> .
@prefix oap:   <http://oapolicy.universityofcalifornia.edu/vocab#> .
@prefix work:  <http://experts.ucdavis.edu/work/> .
@prefix query: <http://experts.ucdavis.edu/schema/queries/> .
@prefix harvest_oap: <http://oapolicy.universityofcalifornia.edu/> .
@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .
@prefix q:     <http://experts.ucdavis.edu/queries/> .
@prefix rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix person: <http://experts.ucdavis.edu/person/> .
@prefix experts_iam: <http://experts.ucdavis.edu/iam/> .
@prefix bibo:  <http://purl.org/ontology/bibo/> .
@prefix experts: <http://experts.ucdavis.edu/> .
@prefix obo:   <http://purl.obolibrary.org/obo/> .

authorship:3266506-3  a  ucdrp:authorship , vivo:Authorship ;
        vivo:rank     3 ;
        vivo:relates  <http://experts.ucdavis.edu/authorship/3266506-3#vcard> , work:3266506 .

<http://experts.ucdavis.edu/authorship/3266506-3#vcard-name>
        a                 vcard:Name ;
        vcard:familyName  "Pastrana" ;
        vcard:givenName   "Ana M" .

<http://experts.ucdavis.edu/authorship/3266506-3#vcard>
        vcard:hasName  <http://experts.ucdavis.edu/authorship/3266506-3#vcard-name> .
#+END_SRC

** Select
For selections we use ~sparql-mode~, which has variable injection similar
to how it's used in the JENA, where variables are overwritten directly over
their variable name counterparts.   The queries can be modified to include a

For some queries this works really well, but there are some gotchas.  This
simple query for counting graphs is a good example.

*** Graph Count

#+name: graph_count_example
#+BEGIN_SRC sparql
select ?graph  (count(*) as ?cnt) WHERE {
{
  graph ?graph { ?s ?p ?o. }
} UNION {
  bind ("default" as ?graph)
  {?s ?p ?o.}
}
} group by ?graph

#+END_SRC

#+RESULTS: graph_count_example
| graph                           |  cnt |
|---------------------------------+------|
| http://experts.ucdavis.edu/oap/ | 2507 |
| http://experts.ucdavis.edu/iam/ |   40 |
| default                         | 2545 |

#+call: graph_count_example(graph="<http://experts.ucdavis.edu/oap/>")

The problem with the above, is that when you overwrite a variable that's an IRI,
and is in the select part of the statement, then you get an error.  The method
to use is to create *another* variable, and only use that to bind to the
variable in the statement you want to use.  The example below shows that
setup, where ~_graph_~ is shadowing the variables.  Another helpful part of
this, is that if your query is big, the shadow variables can be used to limit
the query when parameters aren't passed in.

#+name: graph_count
#+BEGIN_SRC sparql :noweb yes :var _graph_="<http://none>"
<<prefixes>>
select ?graph (count(*) as ?cnt) WHERE {
{
  bind($_graph_ as ?graph)
  graph ?graph { ?s ?p ?o. }
} UNION {
  bind ("default" as ?graph)
  {?s ?p ?o.}
}
} group by ?graph

#+END_SRC

#+RESULTS: graph_count
| graph   |    cnt |
|---------+--------|
| default | 228751 |

So now, you can limit your query to a single graph.

#+call: graph_count(_graph_="<http://experts.ucdavis.edu/iam/>")

#+RESULTS:
| graph                           |    cnt |
|---------------------------------+--------|
| http://experts.ucdavis.edu/iam/ |   2542 |
| default                         | 237279 |


If you are clever,you can also break out of the box that the default values
defined.

#+call: graph_count(_graph_="?g")

#+RESULTS:
| graph                           |    cnt |
|---------------------------------+--------|
| http://experts.ucdavis.edu/oap/ | 226087 |
| http://experts.ucdavis.edu/iam/ |   2710 |
| default                         | 228751 |

You are stll able to update the varibles we haven't thought about.  They may not
always work, but often will.

#+call: graph_count(_graph_="?g",p="rdf:type")

#+RESULTS:
| graph                           |   cnt |
|---------------------------------+-------|
| http://experts.ucdavis.edu/oap/ | 55906 |
| http://experts.ucdavis.edu/iam/ |   950 |
| default                         | 56810 |

*** Type Counts

We can do somthing similar for type counts

#+name: type_count
#+BEGIN_SRC sparql :noweb yes :var _graph_="<http://none>"
<<prefixes>>
select ?graph ?type (count(*) as ?cnt) WHERE {
{
  bind($_graph_ as ?graph)
  graph ?graph { ?s a ?type. }
} UNION {
  bind ("default" as ?graph)
  {?s a ?type.}
}
} group by ?graph ?type order by ?graph ?type

#+END_SRC

#+call: type_count()

#+RESULTS:
| graph   | type                                               | cnt |
|---------+----------------------------------------------------+-----|
| default | http://experts.ucdavis.edu/schema#authorship       | 166 |
| default | http://experts.ucdavis.edu/schema#concept          |  23 |
| default | http://experts.ucdavis.edu/schema#person           |   1 |
| default | http://experts.ucdavis.edu/schema#venue            |  21 |
| default | http://experts.ucdavis.edu/schema#work             |  27 |
| default | http://purl.org/ontology/bibo/AcademicArticle      |  15 |
| default | http://purl.org/ontology/bibo/Journal              |  21 |
| default | http://vivoweb.org/ontology/core#Authorship        | 166 |
| default | http://vivoweb.org/ontology/core#ConferencePaper   |  12 |
| default | http://vivoweb.org/ontology/core#DateTimePrecision |   2 |
| default | http://vivoweb.org/ontology/core#DateTimeValue     |  27 |
| default | http://vivoweb.org/ontology/core#NonAcademic       |   1 |
| default | http://www.w3.org/2004/02/skos/core#Concept        |  23 |
| default | http://www.w3.org/2004/02/skos/core#ConceptScheme  |   2 |
| default | http://www.w3.org/2006/vcard/ns#Email              |   3 |
| default | http://www.w3.org/2006/vcard/ns#Individual         |   3 |
| default | http://www.w3.org/2006/vcard/ns#Name               | 142 |
| default | http://www.w3.org/2006/vcard/ns#Organization       |   2 |
| default | http://www.w3.org/2006/vcard/ns#Title              |   2 |
| default | http://www.w3.org/2006/vcard/ns#Work               |   3 |
| default | http://xmlns.com/foaf/0.1/Person                   |   1 |


#+name: s_of_type
#+BEGIN_SRC sparql :noweb yes :var type="ucdrp:person" limit="5"
<<prefixes>>
select ?s WHERE {
  ?s a ?type.
} limit ?limit
#+END_SRC

#+call: s_of_type()

#+RESULTS:
| s                                                                  |
|--------------------------------------------------------------------|
| http://experts.ucdavis.edu/person/f9ef1e530c617cd598171497b4a49e82 |


#+name: describe_of_type
#+BEGIN_SRC sparql :format raw :wrap SRC ttl :noweb yes :var type="ucdrp:person" limit="5"
<<prefixes>>
describe ?s WHERE {
select ?s WHERE {
  ?s a ?type.
} limit ?limit
}
#+END_SRC

#+call: describe_of_type()  :format raw

#+RESULTS:
#+BEGIN_SRC ttl
@prefix experts_oap: <http://experts.ucdavis.edu/oap/> .
@prefix xsd:   <http://www.w3.org/2001/XMLSchema#> .
@prefix skos:  <http://www.w3.org/2004/02/skos/core#> .
@prefix rdfs:  <http://www.w3.org/2000/01/rdf-schema#> .
@prefix ucdrp: <http://experts.ucdavis.edu/schema#> .
@prefix purl:  <http://purl.org/ontology/bibo/> .
@prefix aeq:   <http://experts.ucdavis.edu/queries/schema#> .
@prefix bind:  <http://experts.ucdavis.edu/schema/bind/> .
@prefix iam:   <http://iam.ucdavis.edu/schema#> .
@prefix authorship: <http://experts.ucdavis.edu/authorship/> .
@prefix vivo:  <http://vivoweb.org/ontology/core#> .
@prefix harvest_iam: <http://iam.ucdavis.edu/> .
@prefix foaf:  <http://xmlns.com/foaf/0.1/> .
@prefix oap:   <http://oapolicy.universityofcalifornia.edu/vocab#> .
@prefix work:  <http://experts.ucdavis.edu/work/> .
@prefix query: <http://experts.ucdavis.edu/schema/queries/> .
@prefix harvest_oap: <http://oapolicy.universityofcalifornia.edu/> .
@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .
@prefix q:     <http://experts.ucdavis.edu/queries/> .
@prefix rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix person: <http://experts.ucdavis.edu/person/> .
@prefix experts_iam: <http://experts.ucdavis.edu/iam/> .
@prefix bibo:  <http://purl.org/ontology/bibo/> .
@prefix experts: <http://experts.ucdavis.edu/> .
@prefix obo:   <http://purl.obolibrary.org/obo/> .

person:f9ef1e530c617cd598171497b4a49e82
        a                     foaf:Person , ucdrp:person , vivo:NonAcademic ;
        rdfs:label            "Quinn Hart" ;
        ucdrp:casId           "quinn" ;
        obo:ARG_2000028       <http://experts.ucdavis.edu/person/f9ef1e530c617cd598171497b4a49e82#vcard> , <http://experts.ucdavis.edu/person/f9ef1e530c617cd598171497b4a49e82#pps-1> , <http://experts.ucdavis.edu/person/f9ef1e530c617cd598171497b4a49e82#odr-1> ;
        vivo:hasResearchArea  <http://experts.ucdavis.edu/concept/FoR/080106> , <http://experts.ucdavis.edu/concept/FoR/080306> , <http://experts.ucdavis.edu/concept/FoR/080604> , <http://experts.ucdavis.edu/concept/FoR/080505> , <http://experts.ucdavis.edu/concept/FoR/08> , <http://experts.ucdavis.edu/concept/FoR/080302> , <http://experts.ucdavis.edu/concept/FoR/080404> , <http://experts.ucdavis.edu/concept/FoR/0804> , <http://experts.ucdavis.edu/concept/FoR/0806> ;
        vivo:overview         "I am currently the digital applications manager for the UC Davis library.  At the Library, I develop research and educational applications for use at the library and to our researchers and the public.\n\nI've been at UC Davis since 1992.  Before coming to the library in 2016, I worked as a programmer under various projects in the Dept. of Land, Air, and Water Resources." ;
        vivo:relatedBy        authorship:2713713 , authorship:1765064 , authorship:2713718 , authorship:1452167-3 , authorship:639836-5 , authorship:2713714-2 , authorship:1442407 , authorship:2713714 , authorship:1875203 , authorship:639836 , authorship:2327636-4 , authorship:2364120 , authorship:1452140-3 , authorship:2713715 , authorship:1765066 , authorship:1765064-1 , authorship:2713720-1 , authorship:2713719 , authorship:1452140 , authorship:1442407-2 , authorship:2439616 , authorship:1765066-2 , authorship:1452167 , authorship:2713712-4 , authorship:2713711 , authorship:1452104-1 , authorship:2713715-3 , authorship:2713717-9 , authorship:1442289-1 , authorship:1434606 , authorship:2449942-1 , authorship:2713718-1 , authorship:1442413-2 , authorship:2713716-2 , authorship:1442400-3 , authorship:2713719-1 , authorship:1445886-4 , authorship:1442400 , authorship:2439616-1 , authorship:2449942 , authorship:2713720 , authorship:2713716 , authorship:2327636 , authorship:2713717 , authorship:1445886 , authorship:2713713-2 , authorship:2713711-2 , authorship:1452104 , authorship:2713712 , authorship:1442413 , authorship:1442289 , authorship:1434606-5 .
#+END_SRC

#+name: author
#+BEGIN_SRC sparql :format raw :wrap SRC ttl :noweb yes :var type="ucdrp:person" limit="5"
<<prefixes>>
describe ?s WHERE {
  select ?s WHERE {
    ?s a ?type.
  } limit ?limit
}
#+END_SRC

#+call: author(limit="1") :format raw

#+RESULTS:
#+BEGIN_SRC ttl
@prefix experts_oap: <http://experts.ucdavis.edu/oap/> .
@prefix xsd:   <http://www.w3.org/2001/XMLSchema#> .
@prefix skos:  <http://www.w3.org/2004/02/skos/core#> .
@prefix rdfs:  <http://www.w3.org/2000/01/rdf-schema#> .
@prefix ucdrp: <http://experts.ucdavis.edu/schema#> .
@prefix purl:  <http://purl.org/ontology/bibo/> .
@prefix aeq:   <http://experts.ucdavis.edu/queries/schema#> .
@prefix bind:  <http://experts.ucdavis.edu/schema/bind/> .
@prefix iam:   <http://iam.ucdavis.edu/schema#> .
@prefix authorship: <http://experts.ucdavis.edu/authorship/> .
@prefix vivo:  <http://vivoweb.org/ontology/core#> .
@prefix harvest_iam: <http://iam.ucdavis.edu/> .
@prefix foaf:  <http://xmlns.com/foaf/0.1/> .
@prefix oap:   <http://oapolicy.universityofcalifornia.edu/vocab#> .
@prefix work:  <http://experts.ucdavis.edu/work/> .
@prefix query: <http://experts.ucdavis.edu/schema/queries/> .
@prefix harvest_oap: <http://oapolicy.universityofcalifornia.edu/> .
@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .
@prefix q:     <http://experts.ucdavis.edu/queries/> .
@prefix rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix person: <http://experts.ucdavis.edu/person/> .
@prefix experts_iam: <http://experts.ucdavis.edu/iam/> .
@prefix bibo:  <http://purl.org/ontology/bibo/> .
@prefix experts: <http://experts.ucdavis.edu/> .
@prefix obo:   <http://purl.obolibrary.org/obo/> .

person:f9ef1e530c617cd598171497b4a49e82
        a                     foaf:Person , ucdrp:person , vivo:NonAcademic ;
        rdfs:label            "Quinn Hart" ;
        ucdrp:casId           "quinn" ;
        obo:ARG_2000028       <http://experts.ucdavis.edu/person/f9ef1e530c617cd598171497b4a49e82#vcard> , <http://experts.ucdavis.edu/person/f9ef1e530c617cd598171497b4a49e82#pps-1> , <http://experts.ucdavis.edu/person/f9ef1e530c617cd598171497b4a49e82#odr-1> ;
        vivo:hasResearchArea  <http://experts.ucdavis.edu/concept/FoR/080106> , <http://experts.ucdavis.edu/concept/FoR/080306> , <http://experts.ucdavis.edu/concept/FoR/080604> , <http://experts.ucdavis.edu/concept/FoR/080505> , <http://experts.ucdavis.edu/concept/FoR/08> , <http://experts.ucdavis.edu/concept/FoR/080302> , <http://experts.ucdavis.edu/concept/FoR/080404> , <http://experts.ucdavis.edu/concept/FoR/0804> , <http://experts.ucdavis.edu/concept/FoR/0806> ;
        vivo:overview         "I am currently the digital applications manager for the UC Davis library.  At the Library, I develop research and educational applications for use at the library and to our researchers and the public.\n\nI've been at UC Davis since 1992.  Before coming to the library in 2016, I worked as a programmer under various projects in the Dept. of Land, Air, and Water Resources." ;
        vivo:relatedBy        authorship:2713713 , authorship:1765064 , authorship:2713718 , authorship:1452167-3 , authorship:639836-5 , authorship:2713714-2 , authorship:1442407 , authorship:2713714 , authorship:1875203 , authorship:639836 , authorship:2327636-4 , authorship:2364120 , authorship:1452140-3 , authorship:2713715 , authorship:1765066 , authorship:1765064-1 , authorship:2713720-1 , authorship:2713719 , authorship:1452140 , authorship:1442407-2 , authorship:2439616 , authorship:1765066-2 , authorship:1452167 , authorship:2713712-4 , authorship:2713711 , authorship:1452104-1 , authorship:2713715-3 , authorship:2713717-9 , authorship:1442289-1 , authorship:1434606 , authorship:2449942-1 , authorship:2713718-1 , authorship:1442413-2 , authorship:2713716-2 , authorship:1442400-3 , authorship:2713719-1 , authorship:1445886-4 , authorship:1442400 , authorship:2439616-1 , authorship:2449942 , authorship:2713720 , authorship:2713716 , authorship:2327636 , authorship:2713717 , authorship:1445886 , authorship:2713713-2 , authorship:2713711-2 , authorship:1452104 , authorship:2713712 , authorship:1442413 , authorship:1442289 , authorship:1434606-5 .
#+END_SRC

#+name: author_authorship
#+BEGIN_SRC sparql  :noweb yes :var limit="5"
<<prefixes>>
#describe ?s WHERE {
#select ?s WHERE {
select ?a
WHERE {
  ?a a ucdrp:authorship;
     vivo:relates ?s;
  .
  {select ?s WHERE {
    ?s a ucdrp:person.
  } limit ?limit}
}
#+END_SRC

#+RESULTS: author_authorship
| a                                               |
|-------------------------------------------------|
| http://experts.ucdavis.edu/authorship/2713713-2 |
| http://experts.ucdavis.edu/authorship/1442400-3 |
| http://experts.ucdavis.edu/authorship/1452104-1 |
| http://experts.ucdavis.edu/authorship/2713716-2 |
| http://experts.ucdavis.edu/authorship/1452167-3 |
| http://experts.ucdavis.edu/authorship/1434606-5 |
| http://experts.ucdavis.edu/authorship/2439616-1 |
| http://experts.ucdavis.edu/authorship/1765064-1 |
| http://experts.ucdavis.edu/authorship/2713718-1 |
| http://experts.ucdavis.edu/authorship/2713714-2 |
| http://experts.ucdavis.edu/authorship/1452140-3 |
| http://experts.ucdavis.edu/authorship/2713717-9 |
| http://experts.ucdavis.edu/authorship/2713712-4 |
| http://experts.ucdavis.edu/authorship/1445886-4 |
| http://experts.ucdavis.edu/authorship/2713715-3 |
| http://experts.ucdavis.edu/authorship/2327636-4 |
| http://experts.ucdavis.edu/authorship/2449942-1 |
| http://experts.ucdavis.edu/authorship/1765066-2 |
| http://experts.ucdavis.edu/authorship/2713711-2 |
| http://experts.ucdavis.edu/authorship/1442413-2 |
| http://experts.ucdavis.edu/authorship/1442289-1 |
| http://experts.ucdavis.edu/authorship/1442407-2 |
| http://experts.ucdavis.edu/authorship/639836-5  |
| http://experts.ucdavis.edu/authorship/2713720-1 |
| http://experts.ucdavis.edu/authorship/2713719-1 |
| http://experts.ucdavis.edu/authorship/2713713   |
| http://experts.ucdavis.edu/authorship/1442400   |
| http://experts.ucdavis.edu/authorship/1452104   |
| http://experts.ucdavis.edu/authorship/2713716   |
| http://experts.ucdavis.edu/authorship/1452167   |
| http://experts.ucdavis.edu/authorship/1434606   |
| http://experts.ucdavis.edu/authorship/2364120   |
| http://experts.ucdavis.edu/authorship/2439616   |
| http://experts.ucdavis.edu/authorship/1765064   |
| http://experts.ucdavis.edu/authorship/2713718   |
| http://experts.ucdavis.edu/authorship/2713714   |
| http://experts.ucdavis.edu/authorship/1452140   |
| http://experts.ucdavis.edu/authorship/2713717   |
| http://experts.ucdavis.edu/authorship/2713712   |
| http://experts.ucdavis.edu/authorship/1445886   |
| http://experts.ucdavis.edu/authorship/1875203   |
| http://experts.ucdavis.edu/authorship/2713715   |
| http://experts.ucdavis.edu/authorship/2327636   |
| http://experts.ucdavis.edu/authorship/2449942   |
| http://experts.ucdavis.edu/authorship/1765066   |
| http://experts.ucdavis.edu/authorship/2713711   |
| http://experts.ucdavis.edu/authorship/1442413   |
| http://experts.ucdavis.edu/authorship/1442289   |
| http://experts.ucdavis.edu/authorship/1442407   |
| http://experts.ucdavis.edu/authorship/639836    |
| http://experts.ucdavis.edu/authorship/2713720   |
| http://experts.ucdavis.edu/authorship/2713719   |


*** Authors

#+name: authors
#+BEGIN_SRC sparql :noweb yes :var _graph_="<http://none>"
<<prefixes>>
select ?author ?email ?casId WHERE {
  bind($_casId_ as ?graph)
  graph ?graph { ?s a ?type. }
} UNION {
  bind ("default" as ?graph)
  {?s a ?type.}
}
} group by ?graph ?type order by ?graph ?type

#+END_SRC

** Construct Statements
:PROPERTIES:
:header-args:sparql: :url http://localhost:8081/experts/sparql :format raw :wrap SRC ttl
:END:

Construct statements can be a little more lenient in the varibles, and so you
may not need to create shadow variables.

*** Deep Select

One thing that we are need to be able to do is to delete and update data that
was created with lots of blank nodes.  The following example is my solution for
deep selects.  This shows the contruction of such a query.  The key is to only
match children that are blank nodes that also have no other non blank node
parent other then your selection.

#+name: deep_select
#+BEGIN_SRC sparql :noweb yes :format raw :wrap SRC ttl :var expert="person:b78c058911b45047c56f3b5148381715"
<<prefixes>>

CONSTRUCT {
   ?person ?prop ?val .
   ?child ?child_p ?child_o .
}
WHERE { graph ?g {
  bind(?expert as ?person)
  ?person ?prop ?val ;
          .
  OPTIONAL {
    ?person (a|!a)+ ?child.
    ?child ?child_p ?child_o.
    filter(isblank(?child))
    FILTER NOT EXISTS {
      ?parent (a|!a)+ ?child.
      filter(isiri(?parent) && ?parent != ?person)
    }
  }
}}
#+END_SRC

#+RESULTS: deep_select
#+BEGIN_SRC ttl
@prefix experts_oap: <http://experts.ucdavis.edu/oap/> .
@prefix work:  <http://experts.library.ucdavis.edu/work/> .
@prefix query: <http://experts.ucdavis.edu/schema/queries/> .
@prefix xsd:   <http://www.w3.org/2001/XMLSchema#> .
@prefix skos:  <http://www.w3.org/2004/02/skos/core#> .
@prefix rdfs:  <http://www.w3.org/2000/01/rdf-schema#> .
@prefix harvest_oap: <http://oapolicy.universityofcalifornia.edu/> .
@prefix ucdrp: <http://experts.ucdavis.edu/schema#> .
@prefix purl:  <http://purl.org/ontology/bibo/> .
@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .
@prefix aeq:   <http://experts.ucdavis.edu/queries/schema#> .
@prefix q:     <http://experts.ucdavis.edu/queries/> .
@prefix bind:  <http://experts.ucdavis.edu/schema/bind/> .
@prefix iam:   <http://iam.ucdavis.edu/schema#> .
@prefix rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix person: <http://experts.ucdavis.edu/person/> .
@prefix experts_iam: <http://experts.ucdavis.edu/iam/> .
@prefix bibo:  <http://purl.org/ontology/bibo/> .
@prefix vivo:  <http://vivoweb.org/ontology/core#> .
@prefix harvest_iam: <http://iam.ucdavis.edu/> .
@prefix experts: <http://experts.ucdavis.edu/> .
@prefix obo:   <http://purl.obolibrary.org/obo/> .
@prefix foaf:  <http://xmlns.com/foaf/0.1/> .
@prefix oap:   <http://oapolicy.universityofcalifornia.edu/vocab#> .

person:b78c058911b45047c56f3b5148381715
        a                vivo:NonAcademic , ucdrp:person ;
        rdfs:label       "Justin Merz" ;
        ucdrp:casId      "jrmerz" ;
        obo:ARG_2000028  [ a                            vcard:Individual ;
                           ucdrp:identifier             "pps-1" ;
                           vivo:rank                    11 ;
                           vcard:hasEmail               [ a            vcard:Work , vcard:Email ;
                                                          vcard:email  "jrmerz@ucdavis.edu"
                                                        ] ;
                           vcard:hasName                [ a                 vcard:Name ;
                                                          vcard:familyName  "Merz" ;
                                                          vcard:givenName   "Justin"
                                                        ] ;
                           vcard:hasOrganizationalUnit  [ a            vcard:Organization ;
                                                          vcard:title  "UCDLIBRARY"
                                                        ] ;
                           vcard:hasTitle               [ a            vcard:Title ;
                                                          vcard:title  "APPLICATIONS PROGR 3"
                                                        ]
                         ] ;
        obo:ARG_2000028  [ a                            vcard:Individual ;
                           ucdrp:identifier             "odr-1" ;
                           vivo:rank                    1 ;
                           vcard:hasEmail               [ a            vcard:Work , vcard:Email ;
                                                          vcard:email  "jrmerz@ucdavis.edu"
                                                        ] ;
                           vcard:hasName                [ a                 vcard:Name ;
                                                          vcard:familyName  "Merz" ;
                                                          vcard:givenName   "Justin"
                                                        ] ;
                           vcard:hasOrganizationalUnit  [ a            vcard:Organization ;
                                                          vcard:title  "Library"
                                                        ] ;
                           vcard:hasTitle               [ a            vcard:Title ;
                                                          vcard:title  "Research Engineer"
                                                        ]
                         ] .
#+END_SRC

#+CALL: deep_select(expert="person:b78c058911b45047c56f3b5148381715")

#+RESULTS:
#+BEGIN_SRC ttl
@prefix experts_oap: <http://experts.ucdavis.edu/oap/> .
@prefix work:  <http://experts.library.ucdavis.edu/work/> .
@prefix query: <http://experts.ucdavis.edu/schema/queries/> .
@prefix xsd:   <http://www.w3.org/2001/XMLSchema#> .
@prefix skos:  <http://www.w3.org/2004/02/skos/core#> .
@prefix rdfs:  <http://www.w3.org/2000/01/rdf-schema#> .
@prefix harvest_oap: <http://oapolicy.universityofcalifornia.edu/> .
@prefix ucdrp: <http://experts.ucdavis.edu/schema#> .
@prefix purl:  <http://purl.org/ontology/bibo/> .
@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .
@prefix aeq:   <http://experts.ucdavis.edu/queries/schema#> .
@prefix q:     <http://experts.ucdavis.edu/queries/> .
@prefix bind:  <http://experts.ucdavis.edu/schema/bind/> .
@prefix iam:   <http://iam.ucdavis.edu/schema#> .
@prefix rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix person: <http://experts.ucdavis.edu/person/> .
@prefix experts_iam: <http://experts.ucdavis.edu/iam/> .
@prefix bibo:  <http://purl.org/ontology/bibo/> .
@prefix vivo:  <http://vivoweb.org/ontology/core#> .
@prefix harvest_iam: <http://iam.ucdavis.edu/> .
@prefix experts: <http://experts.ucdavis.edu/> .
@prefix obo:   <http://purl.obolibrary.org/obo/> .
@prefix foaf:  <http://xmlns.com/foaf/0.1/> .
@prefix oap:   <http://oapolicy.universityofcalifornia.edu/vocab#> .

person:b78c058911b45047c56f3b5148381715
        a                vivo:NonAcademic , ucdrp:person ;
        rdfs:label       "Justin Merz" ;
        ucdrp:casId      "jrmerz" ;
        ucdrp:graph      experts_iam: , experts_oap: ;
        obo:ARG_2000028  [ a                            vcard:Individual ;
                           ucdrp:identifier             "pps-1" ;
                           vivo:rank                    11 ;
                           vcard:hasEmail               [ a            vcard:Work , vcard:Email ;
                                                          vcard:email  "jrmerz@ucdavis.edu"
                                                        ] ;
                           vcard:hasName                [ a                 vcard:Name ;
                                                          vcard:familyName  "Merz" ;
                                                          vcard:givenName   "Justin"
                                                        ] ;
                           vcard:hasOrganizationalUnit  [ a            vcard:Organization ;
                                                          vcard:title  "UCDLIBRARY"
                                                        ] ;
                           vcard:hasTitle               [ a            vcard:Title ;
                                                          vcard:title  "APPLICATIONS PROGR 3"
                                                        ]
                         ] ;
        obo:ARG_2000028  [ a                            vcard:Individual ;
                           ucdrp:identifier             "odr-1" ;
                           vivo:rank                    1 ;
                           vcard:hasEmail               [ a            vcard:Work , vcard:Email ;
                                                          vcard:email  "jrmerz@ucdavis.edu"
                                                        ] ;
                           vcard:hasName                [ a                 vcard:Name ;
                                                          vcard:familyName  "Merz" ;
                                                          vcard:givenName   "Justin"
                                                        ] ;
                           vcard:hasOrganizationalUnit  [ a            vcard:Organization ;
                                                          vcard:title  "Library"
                                                        ] ;
                           vcard:hasTitle               [ a            vcard:Title ;
                                                          vcard:title  "Research Engineer"
                                                        ]
                         ] .
#+END_SRC

It's instructive to compare this to the native describe output.

#+call: describe(uri="person:b78c058911b45047c56f3b5148381715")

#+RESULTS:
#+BEGIN_SRC ttl
@prefix experts_oap: <http://experts.ucdavis.edu/oap/> .
@prefix work:  <http://experts.library.ucdavis.edu/work/> .
@prefix query: <http://experts.ucdavis.edu/schema/queries/> .
@prefix xsd:   <http://www.w3.org/2001/XMLSchema#> .
@prefix skos:  <http://www.w3.org/2004/02/skos/core#> .
@prefix rdfs:  <http://www.w3.org/2000/01/rdf-schema#> .
@prefix harvest_oap: <http://oapolicy.universityofcalifornia.edu/> .
@prefix ucdrp: <http://experts.ucdavis.edu/schema#> .
@prefix purl:  <http://purl.org/ontology/bibo/> .
@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .
@prefix aeq:   <http://experts.ucdavis.edu/queries/schema#> .
@prefix q:     <http://experts.ucdavis.edu/queries/> .
@prefix bind:  <http://experts.ucdavis.edu/schema/bind/> .
@prefix iam:   <http://iam.ucdavis.edu/schema#> .
@prefix rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix person: <http://experts.ucdavis.edu/person/> .
@prefix experts_iam: <http://experts.ucdavis.edu/iam/> .
@prefix bibo:  <http://purl.org/ontology/bibo/> .
@prefix vivo:  <http://vivoweb.org/ontology/core#> .
@prefix harvest_iam: <http://iam.ucdavis.edu/> .
@prefix experts: <http://experts.ucdavis.edu/> .
@prefix obo:   <http://purl.obolibrary.org/obo/> .
@prefix foaf:  <http://xmlns.com/foaf/0.1/> .
@prefix oap:   <http://oapolicy.universityofcalifornia.edu/vocab#> .

person:b78c058911b45047c56f3b5148381715
        a                vivo:NonAcademic , ucdrp:person ;
        rdfs:label       "Justin Merz" ;
        ucdrp:casId      "jrmerz" ;
        obo:ARG_2000028  [ a                            vcard:Individual ;
                           ucdrp:identifier             "pps-1" ;
                           vivo:rank                    11 ;
                           vcard:hasEmail               [ a            vcard:Work , vcard:Email ;
                                                          vcard:email  "jrmerz@ucdavis.edu"
                                                        ] ;
                           vcard:hasName                [ a                 vcard:Name ;
                                                          vcard:familyName  "Merz" ;
                                                          vcard:givenName   "Justin"
                                                        ] ;
                           vcard:hasOrganizationalUnit  [ a            vcard:Organization ;
                                                          vcard:title  "UCDLIBRARY"
                                                        ] ;
                           vcard:hasTitle               [ a            vcard:Title ;
                                                          vcard:title  "APPLICATIONS PROGR 3"
                                                        ]
                         ] ;
        obo:ARG_2000028  [ a                            vcard:Individual ;
                           ucdrp:identifier             "odr-1" ;
                           vivo:rank                    1 ;
                           vcard:hasEmail               [ a            vcard:Work , vcard:Email ;
                                                          vcard:email  "jrmerz@ucdavis.edu"
                                                        ] ;
                           vcard:hasName                [ a                 vcard:Name ;
                                                          vcard:familyName  "Merz" ;
                                                          vcard:givenName   "Justin"
                                                        ] ;
                           vcard:hasOrganizationalUnit  [ a            vcard:Organization ;
                                                          vcard:title  "Library"
                                                        ] ;
                           vcard:hasTitle               [ a            vcard:Title ;
                                                          vcard:title  "Research Engineer"
                                                        ]
                         ] .
#+END_SRC


** Updates

These simple example need might include update queries?
#+name: update_example
#+BEGIN_SRC sparql
<<prefixes>>
#insert  {graph experts_pub: { experts:quinn experts:is experts:great. }} WHERE {}
#delete { graph ?g {?s ?p ?o} } WHERE { graph ?g {?s ?p ?o}}
#select ?g (count(*) as ?cnt) WHERE { graph ?g {?s ?p ?o.}} group by ?g
#select ?o (count(*) as ?cnt) WHERE { graph ?g {?s a ?o. filter(isiri(?s))}} group by ?o

#+END_SRC

#+name: deep_select
#+BEGIN_SRC sparql :noweb yes :format raw :wrap SRC ttl :var expert="person:b78c058911b45047c56f3b5148381715"
<<prefixes>>

 DELETE {
  graph ?g {
   ?expert ?prop ?val .
   ?child ?child_p ?child_o .
  }
}
WHERE {
  graph ?g {
  ?expert ?prop ?val ;
          .
  OPTIONAL {
    ?expert (a|!a)+ ?child.
    ?child ?child_p ?child_o.
      FILTER NOT EXISTS {
        ?parent (a|!a)+ ?child.
        filter(isiri(?parent) && ?parent != ?expert)
      }
    filter(isblank(?child))
    }
  }
}
#+END_SRC

** Publication / Authorship Queries

This query will select a publication, and all the authorships that are related
to that publication.

#+name: pub_auth
#+BEGIN_SRC sparql :format raw :noweb yes :wrap SRC ttl :var uri="work:3266506" limit="100"
<<prefixes>>
describe ?s where {
select ?s where {
{
  SELECT ?s WHERE {
    ?s ?p ?o
    filter(isiri(?s))
    filter(regex(str(?s),concat("^",str(?uri),"#?")))
  }
} UNION {
  select ?s WHERE {
    ?s a vivo:Authorship;
      vivo:relates ?uri;
  .
  }
} } order by ?s limit ?limit }
#+END_SRC

#+call: pub_auth(uri="work:3266506" limit="0") :format raw :wrap SRC ttl

#+RESULTS:
#+BEGIN_SRC ttl
@prefix experts_oap: <http://experts.ucdavis.edu/oap/> .
@prefix work:  <http://experts.ucdavis.edu/work/> .
@prefix query: <http://experts.ucdavis.edu/schema/queries/> .
@prefix xsd:   <http://www.w3.org/2001/XMLSchema#> .
@prefix skos:  <http://www.w3.org/2004/02/skos/core#> .
@prefix rdfs:  <http://www.w3.org/2000/01/rdf-schema#> .
@prefix harvest_oap: <http://oapolicy.universityofcalifornia.edu/> .
@prefix ucdrp: <http://experts.ucdavis.edu/schema#> .
@prefix purl:  <http://purl.org/ontology/bibo/> .
@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .
@prefix aeq:   <http://experts.ucdavis.edu/queries/schema#> .
@prefix q:     <http://experts.ucdavis.edu/queries/> .
@prefix bind:  <http://experts.ucdavis.edu/schema/bind/> .
@prefix iam:   <http://iam.ucdavis.edu/schema#> .
@prefix rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix person: <http://experts.ucdavis.edu/person/> .
@prefix experts_iam: <http://experts.ucdavis.edu/iam/> .
@prefix bibo:  <http://purl.org/ontology/bibo/> .
@prefix vivo:  <http://vivoweb.org/ontology/core#> .
@prefix harvest_iam: <http://iam.ucdavis.edu/> .
@prefix experts: <http://experts.ucdavis.edu/> .
@prefix obo:   <http://purl.obolibrary.org/obo/> .
@prefix foaf:  <http://xmlns.com/foaf/0.1/> .
@prefix oap:   <http://oapolicy.universityofcalifornia.edu/vocab#> .

<http://experts.ucdavis.edu/authorship/3266506>
        a              ucdrp:authorship , vivo:Authorship ;
        vivo:favorite  "false" ;
        vivo:relates   work:3266506 , person:8aacf919206c6655bc3edbdf25ec7c08 .

<http://experts.ucdavis.edu/authorship/3266506-2>
        a             ucdrp:authorship , vivo:Authorship ;
        vivo:rank     2 ;
        vivo:relates  <http://experts.ucdavis.edu/authorship/3266506-2#vcard> , work:3266506 .

work:3266506  a                     bibo:AcademicArticle , ucdrp:work ;
        rdfs:label                  "Identification and evaluation of volatile organic compounds evolved during solarization with almond hull and shell amendments." ;
        ucdrp:insertionDateTime     "2021-03-23T18:19:16.746+00:00"^^xsd:dateTime ;
        ucdrp:lastModifiedDateTime  "2021-03-21T16:21:30.95-07:00"^^xsd:dateTime ;
        bibo:abstract               "Biosolarization is a fumigation alternative that combines solarization with organic amendments to suppress pests and pathogens in agricultural soils. The generation of volatile biopesticides in the soil, stemming from biodegradation of carbon-rich amendments, contributes to pest inactivation. The purpose of this study was to (1) profile volatiles that may contribute to pest control under field conditions and (2) measure volatile compounds that may present nuisance or exposure risks for humans near biosolarized fields where larger-scale anaerobic degradation of residues occurs. Biosolarization was performed using prominent agricultural waste products, hulls and shells from several almond varieties as soil amendments. After 8 days of biosolarization, soil samples were analyzed using solid phase microextraction-gas chromatography coupled to mass spectrometry. Volatile fatty acids and ketones made up 85% of biosolarized soil headspace, but terpenes, alcohols, aldehydes, esters, and sulfides were detected as well. Different almond variety residues produced distinct volatile profiles, and nonpareil-amended soils had a much richer and more diverse profile, as well as a fivefold greater VOC abundance, than pollinator-amended soil. Identified volatiles with low US recommended exposure limits were quantified via internal and external standards, including acetic acid, 2-butanone, butanal, hexanal, and phenylethyl alcohol. Across biosolarization treatments, headspace concentrations of selected compounds did not exceed 1 mg/m<sup>3</sup>. This study demonstrates that almond processing residues recycled into the soil as biosolarization substrates produce a high diversity of bioactive degradation compounds on a field scale, with low potential of non-target risks to humans.<i>Implications</i>: This manuscript has implications for two policy goals in the state of California: to reduce landfill disposal of organic waste, and to reduce emissions from soil fumigants. Almond hulls and shells are an increasing source of organic waste, and novel recycling strategies must be developed. Here, recycling almond residues as soil amendments promoted the rapid formation of VOCs which may act as alternatives to chemical fumigants. Headspace concentrations of potentially deleterious VOCs produced from treated soil were low, on the order of parts per billion. These results will help achieve policy goals by expanding waste usage and fumigation alternatives." ;
        bibo:doi                    "10.1080/10962247.2020.1846637" ;
        bibo:issue                  "3" ;
        bibo:journal                "Journal of the Air & Waste Management Association (1995)" ;
        bibo:pageEnd                "412" ;
        bibo:pageStart              "400" ;
        bibo:status                 bibo:published ;
        bibo:volume                 "71" ;
        vivo:dateTimeValue          [ a                       vivo:DateTimeValue ;
                                      vivo:dateTime           "2021-03-01T00:00:00"^^xsd:dateTime ;
                                      vivo:dateTimePrecision  vivo:yearMonthPrecision
                                    ] ;
        vivo:hasPublicationVenue    <http://experts.ucdavis.edu/venue/issn:1096-2247> ;
        vivo:hasSubjectArea         <http://experts.ucdavis.edu/concept/FoR/09> , <http://experts.ucdavis.edu/concept/free/93a30171e623ff1611c2207347f2dc6a> , <http://experts.ucdavis.edu/concept/FoR/05> ;
        vivo:relatedBy              <http://experts.ucdavis.edu/authorship/3266506-2> , <http://experts.ucdavis.edu/authorship/3266506> , <http://experts.ucdavis.edu/authorship/3266506-1> , <http://experts.ucdavis.edu/authorship/3266506-4> , <http://experts.ucdavis.edu/authorship/3266506-3> .

<http://experts.ucdavis.edu/authorship/3266506-3>
        a             ucdrp:authorship , vivo:Authorship ;
        vivo:rank     3 ;
        vivo:relates  <http://experts.ucdavis.edu/authorship/3266506-3#vcard> , work:3266506 .

<http://experts.ucdavis.edu/authorship/3266506-1>
        a             ucdrp:authorship , vivo:Authorship ;
        vivo:rank     1 ;
        vivo:relates  <http://experts.ucdavis.edu/authorship/3266506-1#vcard> , work:3266506 .

<http://experts.ucdavis.edu/authorship/3266506-4>
        a             ucdrp:authorship , vivo:Authorship ;
        vivo:rank     4 ;
        vivo:relates  <http://experts.ucdavis.edu/authorship/3266506-4#vcard> , work:3266506 .
#+END_SRC

** Harvest Queries

All of these items should be called, so that you can specify the appropriate
harvest endpoint

*** List categories

This gives a list of all the categories in the setup

#+name: harvest_cats
#+BEGIN_SRC sparql :noweb yes
<<prefixes>>
select ?cat (count(*) as ?cnt) where { graph harvest_oap: {
    ?s oap:category ?cat.
    filter(isiri(?s))
  }
} group by ?cat order by ?cat
#+END_SRC

prescient#+call: harvest_cats() :url http://localhost:8081/harvest.LoBS/sparql

#+RESULTS:
| cat         | cnt |
|-------------+-----|
| publication |  30 |
| user        |   1 |

*** List 1st class objects

#+name: harvest_objects
#+BEGIN_SRC sparql :noweb yes :var _cat_="?_cat_" limit="5"
<<prefixes>>
select ?s ?cat where { graph harvest_oap: {
    bind($_cat_ as ?cat)
    ?s oap:category ?cat.
    filter(isiri(?s))
  }
} order by ?cat ?s limit ?limit
#+END_SRC

#+call: harvest_objects(_cat_="'user'") :url http://localhost:8081/harvest.LoBS/sparql

#+RESULTS:
| s                                                | cat  |
|--------------------------------------------------+------|
| http://oapolicy.universityofcalifornia.edu/90492 | user |


*** Describe a Publication

#+name: harvest_pub
#+BEGIN_SRC sparql :format raw :noweb yes :wrap SRC ttl :var uri="harvest_oap:3266506"
<<prefixes>>
describe ?s where { graph harvest_oap: {
{
    ?s ?p ?o.
    filter(isiri(?s))
    filter(regex(str(?s),concat("^",str(?uri),"#?")))
  }
} } order by ?s
#+END_SRC

#+call: harvest_pub(uri="harvest_oap:3266506") :url http://localhost:8081/harvest.LoBS/sparql :format raw :wrap SRC ttl


#+name: harvest_pub_records
#+BEGIN_SRC sparql :format raw :noweb yes :wrap SRC ttl :var uri="harvest_oap:none"
<<prefixes>>
describe ?record where { graph harvest_oap: {
{
    ?s oap:category "publication";
       oap:records/oap:record ?record;
    .
    filter(?s=?uri)
  }
} } order by ?record

#+END_SRC

#+call: harvest_pub_records(uri="harvest_oap:3266506") :url http://localhost:8081/harvest.LoBS/sparql :format raw :wrap SRC ttl

#+RESULTS:
#+BEGIN_SRC ttl
@prefix experts_oap: <http://experts.ucdavis.edu/oap/> .
@prefix work:  <http://experts.ucdavis.edu/work/> .
@prefix query: <http://experts.ucdavis.edu/schema/queries/> .
@prefix xsd:   <http://www.w3.org/2001/XMLSchema#> .
@prefix skos:  <http://www.w3.org/2004/02/skos/core#> .
@prefix rdfs:  <http://www.w3.org/2000/01/rdf-schema#> .
@prefix harvest_oap: <http://oapolicy.universityofcalifornia.edu/> .
@prefix ucdrp: <http://experts.ucdavis.edu/schema#> .
@prefix purl:  <http://purl.org/ontology/bibo/> .
@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .
@prefix aeq:   <http://experts.ucdavis.edu/queries/schema#> .
@prefix q:     <http://experts.ucdavis.edu/queries/> .
@prefix bind:  <http://experts.ucdavis.edu/schema/bind/> .
@prefix iam:   <http://iam.ucdavis.edu/schema#> .
@prefix rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix person: <http://experts.ucdavis.edu/person/> .
@prefix experts_iam: <http://experts.ucdavis.edu/iam/> .
@prefix bibo:  <http://purl.org/ontology/bibo/> .
@prefix vivo:  <http://vivoweb.org/ontology/core#> .
@prefix harvest_iam: <http://iam.ucdavis.edu/> .
@prefix experts: <http://experts.ucdavis.edu/> .
@prefix obo:   <http://purl.obolibrary.org/obo/> .
@prefix foaf:  <http://xmlns.com/foaf/0.1/> .
@prefix oap:   <http://oapolicy.universityofcalifornia.edu/vocab#> .

harvest_oap:10501088  oap:citation-count
                "1" ;
        oap:format               "native" ;
        oap:id-at-source         "WOS:000607440800001" ;
        oap:native               [ oap:field  [ oap:display-name  "ISSN" ;
                                                oap:links         [ oap:link  [ oap:href  "https://oapolicy.universityofcalifornia.edu:8002/elements-secure-api/v5.5/journals/1722858" ;
                                                                                oap:type  "elements/journal"
                                                                              ]
                                                                  ] ;
                                                oap:name          "issn" ;
                                                oap:text          "1096-2247" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Authors" ;
                                                oap:name          "authors" ;
                                                oap:people        [ oap:person  ( [ oap:first-names           "Emily" ;
                                                                                    oap:initials              "E" ;
                                                                                    oap:last-name             "Shea" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Emily" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:first-names           "Jesus D" ;
                                                                                    oap:initials              "JD" ;
                                                                                    oap:last-name             "Fernandez-Bayo" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Jesus" "D" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:first-names           "Ana M" ;
                                                                                    oap:initials              "AM" ;
                                                                                    oap:last-name             "Pastrana" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Ana" "M" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:first-names           "Christopher W" ;
                                                                                    oap:initials              "CW" ;
                                                                                    oap:last-name             "Simmons" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Christopher" "W" )
                                                                                                              ]
                                                                                  ]
                                                                                )
                                                                  ] ;
                                                oap:type          "person-list"
                                              ] ;
                                   oap:field  [ oap:display-name  "External identifiers" ;
                                                oap:identifiers   [ oap:identifier  [ oap:field-value  "PR7VD" ;
                                                                                      oap:scheme       "isidoc"
                                                                                    ] ;
                                                                    oap:identifier  [ oap:field-value  "33320806" ;
                                                                                      oap:scheme       "pubmed"
                                                                                    ]
                                                                  ] ;
                                                oap:name          "external-identifiers" ;
                                                oap:type          "identifier-list"
                                              ] ;
                                   oap:field  [ oap:display-name  "Status" ;
                                                oap:name          "publication-status" ;
                                                oap:text          "Published" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Author URL" ;
                                                oap:name          "author-url" ;
                                                oap:text          "http://gateway.webofknowledge.com/gateway/Gateway.cgi?GWVersion=2&SrcApp=PARTNER_APP&SrcAuth=LinksAMR&KeyUT=WOS:000607440800001&DestLinkType=FullRecord&DestApp=ALL_WOS&UsrCustomerID=039f08444e522f04b0c74ec005e57dc4" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Journal" ;
                                                oap:name          "journal" ;
                                                oap:text          "JOURNAL OF THE AIR & WASTE MANAGEMENT ASSOCIATION" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Title" ;
                                                oap:name          "title" ;
                                                oap:text          "Identification and evaluation of volatile organic compounds evolved during solarization with almond hull and shell amendments" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "DOI" ;
                                                oap:links         [ oap:link  [ oap:href  "http://www.altmetric.com/details.php?doi=10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "altmetric"
                                                                              ] ;
                                                                    oap:link  [ oap:href  "http://doi.org/10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "doi"
                                                                              ]
                                                                  ] ;
                                                oap:name          "doi" ;
                                                oap:text          "10.1080/10962247.2020.1846637" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:date          [ oap:day    "11" ;
                                                                    oap:month  "1" ;
                                                                    oap:year   "2021"
                                                                  ] ;
                                                oap:display-name  "Publication date" ;
                                                oap:name          "publication-date" ;
                                                oap:type          "date"
                                              ] ;
                                   oap:field  [ oap:display-name  "eISSN" ;
                                                oap:links         [ oap:link  [ oap:href  "https://oapolicy.universityofcalifornia.edu:8002/elements-secure-api/v5.5/journals/1722858" ;
                                                                                oap:type  "elements/journal"
                                                                              ]
                                                                  ] ;
                                                oap:name          "eissn" ;
                                                oap:text          "2162-2906" ;
                                                oap:type          "text"
                                              ]
                                 ] ;
        oap:source-display-name  "Web of Science (Lite)" ;
        oap:source-id            "11" ;
        oap:source-name          "wos-lite" .

harvest_oap:10501716  oap:format  "native" ;
        oap:id-at-source         "33320806" ;
        oap:native               [ oap:field  [ oap:display-name  "Pagination" ;
                                                oap:name          "pagination" ;
                                                oap:pagination    [ oap:begin-page  "400" ;
                                                                    oap:end-page    "412"
                                                                  ] ;
                                                oap:type          "pagination"
                                              ] ;
                                   oap:field  [ oap:display-name  "Volume" ;
                                                oap:name          "volume" ;
                                                oap:text          "71" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Title" ;
                                                oap:name          "title" ;
                                                oap:text          "Identification and evaluation of volatile organic compounds evolved during solarization with almond hull and shell amendments." ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "DOI" ;
                                                oap:links         [ oap:link  [ oap:href  "http://doi.org/10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "doi"
                                                                              ] ;
                                                                    oap:link  [ oap:href  "http://www.altmetric.com/details.php?doi=10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "altmetric"
                                                                              ]
                                                                  ] ;
                                                oap:name          "doi" ;
                                                oap:text          "10.1080/10962247.2020.1846637" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Issue" ;
                                                oap:name          "issue" ;
                                                oap:text          "3" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Country" ;
                                                oap:name          "location" ;
                                                oap:text          "United States" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Language" ;
                                                oap:name          "language" ;
                                                oap:text          "eng" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:date          [ oap:month  "3" ;
                                                                    oap:year   "2021"
                                                                  ] ;
                                                oap:display-name  "Publication date" ;
                                                oap:name          "publication-date" ;
                                                oap:type          "date"
                                              ] ;
                                   oap:field  [ oap:display-name  "eISSN" ;
                                                oap:links         [ oap:link  [ oap:href  "https://oapolicy.universityofcalifornia.edu:8002/elements-secure-api/v5.5/journals/1722858" ;
                                                                                oap:type  "elements/journal"
                                                                              ]
                                                                  ] ;
                                                oap:name          "eissn" ;
                                                oap:text          "2162-2906" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Status" ;
                                                oap:name          "publication-status" ;
                                                oap:text          "Published" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Abstract" ;
                                                oap:name          "abstract" ;
                                                oap:text          "Biosolarization is a fumigation alternative that combines solarization with organic amendments to suppress pests and pathogens in agricultural soils. The generation of volatile biopesticides in the soil, stemming from biodegradation of carbon-rich amendments, contributes to pest inactivation. The purpose of this study was to (1) profile volatiles that may contribute to pest control under field conditions and (2) measure volatile compounds that may present nuisance or exposure risks for humans near biosolarized fields where larger-scale anaerobic degradation of residues occurs. Biosolarization was performed using prominent agricultural waste products, hulls and shells from several almond varieties as soil amendments. After 8 days of biosolarization, soil samples were analyzed using solid phase microextraction-gas chromatography coupled to mass spectrometry. Volatile fatty acids and ketones made up 85% of biosolarized soil headspace, but terpenes, alcohols, aldehydes, esters, and sulfides were detected as well. Different almond variety residues produced distinct volatile profiles, and nonpareil-amended soils had a much richer and more diverse profile, as well as a fivefold greater VOC abundance, than pollinator-amended soil. Identified volatiles with low US recommended exposure limits were quantified via internal and external standards, including acetic acid, 2-butanone, butanal, hexanal, and phenylethyl alcohol. Across biosolarization treatments, headspace concentrations of selected compounds did not exceed 1 mg/m3. This study demonstrates that almond processing residues recycled into the soil as biosolarization substrates produce a high diversity of bioactive degradation compounds on a field scale, with low potential of non-target risks to humans.Implications: This manuscript has implications for two policy goals in the state of California: to reduce landfill disposal of organic waste, and to reduce emissions from soil fumigants. Almond hulls and shells are an increasing source of organic waste, and novel recycling strategies must be developed. Here, recycling almond residues as soil amendments promoted the rapid formation of VOCs which may act as alternatives to chemical fumigants. Headspace concentrations of potentially deleterious VOCs produced from treated soil were low, on the order of parts per billion. These results will help achieve policy goals by expanding waste usage and fumigation alternatives." ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Sub types" ;
                                                oap:items         [ oap:item  "Journal Article" ] ;
                                                oap:name          "types" ;
                                                oap:type          "list"
                                              ] ;
                                   oap:field  [ oap:display-name  "Journal" ;
                                                oap:name          "journal" ;
                                                oap:text          "J Air Waste Manag Assoc" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Authors" ;
                                                oap:name          "authors" ;
                                                oap:people        [ oap:person  ( [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "Food Science & Technology, UC Davis, Davis, CA, USA." ;
                                                                                                                                                       oap:type         "full"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "Emily" ;
                                                                                    oap:initials              "E" ;
                                                                                    oap:last-name             "Shea" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Emily" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "Biological & Agricultural Engineering, UC Davis, Davis, CA, USA." ;
                                                                                                                                                       oap:type         "full"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "Jesus D" ;
                                                                                    oap:initials              "JD" ;
                                                                                    oap:last-name             "Fernandez-Bayo" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Jesus" "D" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "Plant Pathology, UC Davis, Davis, CA, USA." ;
                                                                                                                                                       oap:type         "full"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "Ana M" ;
                                                                                    oap:initials              "AM" ;
                                                                                    oap:last-name             "Pastrana" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Ana" "M" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "Food Science & Technology, UC Davis, Davis, CA, USA." ;
                                                                                                                                                       oap:type         "full"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "Christopher W" ;
                                                                                    oap:initials              "CW" ;
                                                                                    oap:last-name             "Simmons" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Christopher" "W" )
                                                                                                              ]
                                                                                  ]
                                                                                )
                                                                  ] ;
                                                oap:type          "person-list"
                                              ] ;
                                   oap:field  [ oap:display-name  "Author URL" ;
                                                oap:name          "author-url" ;
                                                oap:text          "https://www.ncbi.nlm.nih.gov/pubmed/33320806" ;
                                                oap:type          "text"
                                              ]
                                 ] ;
        oap:source-display-name  "PubMed" ;
        oap:source-id            "2" ;
        oap:source-name          "pubmed" .

harvest_oap:10501934  oap:citation-count
                "0" ;
        oap:format               "native" ;
        oap:id-at-source         "MED:33320806" ;
        oap:native               [ oap:field  [ oap:date          [ oap:day    "15" ;
                                                                    oap:month  "12" ;
                                                                    oap:year   "2020"
                                                                  ] ;
                                                oap:display-name  "Record created at source" ;
                                                oap:name          "record-created-at-source-date" ;
                                                oap:type          "date"
                                              ] ;
                                   oap:field  [ oap:display-name  "Journal" ;
                                                oap:name          "journal" ;
                                                oap:text          "Journal of the Air & Waste Management Association (1995)" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Authors" ;
                                                oap:name          "authors" ;
                                                oap:people        [ oap:person  ( [ oap:first-names           "Emily" ;
                                                                                    oap:initials              "E" ;
                                                                                    oap:last-name             "Shea" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Emily" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:first-names           "Jesus D" ;
                                                                                    oap:initials              "JD" ;
                                                                                    oap:last-name             "Fernandez-Bayo" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Jesus" "D" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:first-names           "Ana M" ;
                                                                                    oap:initials              "AM" ;
                                                                                    oap:last-name             "Pastrana" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Ana" "M" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:first-names           "Christopher W" ;
                                                                                    oap:initials              "CW" ;
                                                                                    oap:last-name             "Simmons" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Christopher" "W" )
                                                                                                              ]
                                                                                  ]
                                                                                )
                                                                  ] ;
                                                oap:type          "person-list"
                                              ] ;
                                   oap:field  [ oap:addresses     [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                   oap:iso-country-code  "US" ;
                                                                                   oap:line              [ oap:field-value  "Food Science & Technology, UC Davis, Davis, CA, USA." ;
                                                                                                           oap:type         "full"
                                                                                                         ]
                                                                                 ]
                                                                  ] ;
                                                oap:display-name  "Addresses" ;
                                                oap:name          "addresses" ;
                                                oap:type          "address-list"
                                              ] ;
                                   oap:field  [ oap:display-name  "Issue" ;
                                                oap:name          "issue" ;
                                                oap:text          "3" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "ISSN" ;
                                                oap:links         [ oap:link  [ oap:href  "https://oapolicy.universityofcalifornia.edu:8002/elements-secure-api/v5.5/journals/1722858" ;
                                                                                oap:type  "elements/journal"
                                                                              ]
                                                                  ] ;
                                                oap:name          "issn" ;
                                                oap:text          "1096-2247" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Sub types" ;
                                                oap:items         [ oap:item  "Journal Article" ] ;
                                                oap:name          "types" ;
                                                oap:type          "list"
                                              ] ;
                                   oap:field  [ oap:display-name  "Pagination" ;
                                                oap:name          "pagination" ;
                                                oap:pagination    [ oap:begin-page  "400" ;
                                                                    oap:end-page    "412"
                                                                  ] ;
                                                oap:type          "pagination"
                                              ] ;
                                   oap:field  [ oap:boolean       "false" ;
                                                oap:display-name  "Open access" ;
                                                oap:name          "is-open-access" ;
                                                oap:type          "boolean"
                                              ] ;
                                   oap:field  [ oap:display-name  "Status" ;
                                                oap:name          "publication-status" ;
                                                oap:text          "Published" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Title" ;
                                                oap:name          "title" ;
                                                oap:text          "Identification and evaluation of volatile organic compounds evolved during solarization with almond hull and shell amendments." ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Language" ;
                                                oap:name          "language" ;
                                                oap:text          "eng" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Volume" ;
                                                oap:name          "volume" ;
                                                oap:text          "71" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "DOI" ;
                                                oap:links         [ oap:link  [ oap:href  "http://www.altmetric.com/details.php?doi=10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "altmetric"
                                                                              ] ;
                                                                    oap:link  [ oap:href  "http://doi.org/10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "doi"
                                                                              ]
                                                                  ] ;
                                                oap:name          "doi" ;
                                                oap:text          "10.1080/10962247.2020.1846637" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Abstract" ;
                                                oap:name          "abstract" ;
                                                oap:text          "Biosolarization is a fumigation alternative that combines solarization with organic amendments to suppress pests and pathogens in agricultural soils. The generation of volatile biopesticides in the soil, stemming from biodegradation of carbon-rich amendments, contributes to pest inactivation. The purpose of this study was to (1) profile volatiles that may contribute to pest control under field conditions and (2) measure volatile compounds that may present nuisance or exposure risks for humans near biosolarized fields where larger-scale anaerobic degradation of residues occurs. Biosolarization was performed using prominent agricultural waste products, hulls and shells from several almond varieties as soil amendments. After 8 days of biosolarization, soil samples were analyzed using solid phase microextraction-gas chromatography coupled to mass spectrometry. Volatile fatty acids and ketones made up 85% of biosolarized soil headspace, but terpenes, alcohols, aldehydes, esters, and sulfides were detected as well. Different almond variety residues produced distinct volatile profiles, and nonpareil-amended soils had a much richer and more diverse profile, as well as a fivefold greater VOC abundance, than pollinator-amended soil. Identified volatiles with low US recommended exposure limits were quantified via internal and external standards, including acetic acid, 2-butanone, butanal, hexanal, and phenylethyl alcohol. Across biosolarization treatments, headspace concentrations of selected compounds did not exceed 1 mg/m<sup>3</sup>. This study demonstrates that almond processing residues recycled into the soil as biosolarization substrates produce a high diversity of bioactive degradation compounds on a field scale, with low potential of non-target risks to humans.<i>Implications</i>: This manuscript has implications for two policy goals in the state of California: to reduce landfill disposal of organic waste, and to reduce emissions from soil fumigants. Almond hulls and shells are an increasing source of organic waste, and novel recycling strategies must be developed. Here, recycling almond residues as soil amendments promoted the rapid formation of VOCs which may act as alternatives to chemical fumigants. Headspace concentrations of potentially deleterious VOCs produced from treated soil were low, on the order of parts per billion. These results will help achieve policy goals by expanding waste usage and fumigation alternatives." ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Medium" ;
                                                oap:name          "medium" ;
                                                oap:text          "Print-Electronic" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:date          [ oap:month  "3" ;
                                                                    oap:year   "2021"
                                                                  ] ;
                                                oap:display-name  "Publication date" ;
                                                oap:name          "publication-date" ;
                                                oap:type          "date"
                                              ] ;
                                   oap:field  [ oap:display-name  "eISSN" ;
                                                oap:links         [ oap:link  [ oap:href  "https://oapolicy.universityofcalifornia.edu:8002/elements-secure-api/v5.5/journals/1722858" ;
                                                                                oap:type  "elements/journal"
                                                                              ]
                                                                  ] ;
                                                oap:name          "eissn" ;
                                                oap:text          "2162-2906" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "External identifiers" ;
                                                oap:identifiers   [ oap:identifier  [ oap:field-value  "33320806" ;
                                                                                      oap:scheme       "pubmed"
                                                                                    ]
                                                                  ] ;
                                                oap:name          "external-identifiers" ;
                                                oap:type          "identifier-list"
                                              ]
                                 ] ;
        oap:source-display-name  "Europe PubMed Central" ;
        oap:source-id            "18" ;
        oap:source-name          "epmc" .

harvest_oap:10501712  oap:format  "native" ;
        oap:id-at-source         "pub.1133540238" ;
        oap:native               [ oap:field  [ oap:display-name  "ISSN" ;
                                                oap:links         [ oap:link  [ oap:href  "https://oapolicy.universityofcalifornia.edu:8002/elements-secure-api/v5.5/journals/1722858" ;
                                                                                oap:type  "elements/journal"
                                                                              ]
                                                                  ] ;
                                                oap:name          "issn" ;
                                                oap:text          "1096-2247" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Authors" ;
                                                oap:name          "authors" ;
                                                oap:people        [ oap:person  ( [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "United States" ;
                                                                                                                                                       oap:type         "country"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "Davis" ;
                                                                                                                                                       oap:type         "city"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "California" ;
                                                                                                                                                       oap:type         "state"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "University of California, Davis" ;
                                                                                                                                                       oap:type         "organisation"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "Emily" ;
                                                                                    oap:identifiers           [ oap:identifier  [ oap:field-value  "ur.010457067653.30" ;
                                                                                                                                  oap:scheme       "dimensions-researcher-id"
                                                                                                                                ]
                                                                                                              ] ;
                                                                                    oap:initials              "E" ;
                                                                                    oap:last-name             "Shea" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Emily" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "University of California, Davis" ;
                                                                                                                                                       oap:type         "organisation"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "Davis" ;
                                                                                                                                                       oap:type         "city"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "California" ;
                                                                                                                                                       oap:type         "state"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "United States" ;
                                                                                                                                                       oap:type         "country"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "Jesus D" ;
                                                                                    oap:identifiers           [ oap:identifier  [ oap:field-value  "ur.01200243654.74" ;
                                                                                                                                  oap:scheme       "dimensions-researcher-id"
                                                                                                                                ]
                                                                                                              ] ;
                                                                                    oap:initials              "JD" ;
                                                                                    oap:last-name             "Fernandez-Bayo" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Jesus" "D" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "University of California, Davis" ;
                                                                                                                                                       oap:type         "organisation"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "Davis" ;
                                                                                                                                                       oap:type         "city"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "California" ;
                                                                                                                                                       oap:type         "state"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "United States" ;
                                                                                                                                                       oap:type         "country"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "Ana M" ;
                                                                                    oap:identifiers           [ oap:identifier  [ oap:field-value  "ur.010142216013.35" ;
                                                                                                                                  oap:scheme       "dimensions-researcher-id"
                                                                                                                                ]
                                                                                                              ] ;
                                                                                    oap:initials              "AM" ;
                                                                                    oap:last-name             "Pastrana" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Ana" "M" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "California" ;
                                                                                                                                                       oap:type         "state"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "United States" ;
                                                                                                                                                       oap:type         "country"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "University of California, Davis" ;
                                                                                                                                                       oap:type         "organisation"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "Davis" ;
                                                                                                                                                       oap:type         "city"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "Christopher W" ;
                                                                                    oap:identifiers           [ oap:identifier  [ oap:field-value  "ur.01052702522.24" ;
                                                                                                                                  oap:scheme       "dimensions-researcher-id"
                                                                                                                                ]
                                                                                                              ] ;
                                                                                    oap:initials              "CW" ;
                                                                                    oap:last-name             "Simmons" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Christopher" "W" )
                                                                                                              ]
                                                                                  ]
                                                                                )
                                                                  ] ;
                                                oap:type          "person-list"
                                              ] ;
                                   oap:field  [ oap:display-name  "DOI" ;
                                                oap:links         [ oap:link  [ oap:href  "http://doi.org/10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "doi"
                                                                              ] ;
                                                                    oap:link  [ oap:href  "http://www.altmetric.com/details.php?doi=10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "altmetric"
                                                                              ]
                                                                  ] ;
                                                oap:name          "doi" ;
                                                oap:text          "10.1080/10962247.2020.1846637" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:date          [ oap:day    "17" ;
                                                                    oap:month  "12" ;
                                                                    oap:year   "2020"
                                                                  ] ;
                                                oap:display-name  "Record created at source" ;
                                                oap:name          "record-created-at-source-date" ;
                                                oap:type          "date"
                                              ] ;
                                   oap:field  [ oap:display-name  "External identifiers" ;
                                                oap:identifiers   [ oap:identifier  [ oap:field-value  "33320806" ;
                                                                                      oap:scheme       "pubmed"
                                                                                    ]
                                                                  ] ;
                                                oap:name          "external-identifiers" ;
                                                oap:type          "identifier-list"
                                              ] ;
                                   oap:field  [ oap:display-name  "Pagination" ;
                                                oap:name          "pagination" ;
                                                oap:pagination    [ oap:begin-page  "1" ;
                                                                    oap:end-page    "13"
                                                                  ] ;
                                                oap:type          "pagination"
                                              ] ;
                                   oap:field  [ oap:date          [ oap:day    "13" ;
                                                                    oap:month  "1" ;
                                                                    oap:year   "2021"
                                                                  ] ;
                                                oap:display-name  "Publication date" ;
                                                oap:name          "publication-date" ;
                                                oap:type          "date"
                                              ] ;
                                   oap:field  [ oap:display-name  "Title" ;
                                                oap:name          "title" ;
                                                oap:text          "Identification and evaluation of volatile organic compounds evolved during solarization with almond hull and shell amendments" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Altmetric attention score" ;
                                                oap:integer       "1" ;
                                                oap:name          "altmetric-attention-score" ;
                                                oap:type          "integer"
                                              ] ;
                                   oap:field  [ oap:display-name  "Volume" ;
                                                oap:name          "volume" ;
                                                oap:text          "71" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Issue" ;
                                                oap:name          "issue" ;
                                                oap:text          "3" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Journal" ;
                                                oap:name          "journal" ;
                                                oap:text          "Journal of the Air & Waste Management Association" ;
                                                oap:type          "text"
                                              ]
                                 ] ;
        oap:source-display-name  "Dimensions" ;
        oap:source-id            "10" ;
        oap:source-name          "dimensions" .

harvest_oap:10931798  oap:citation-count
                "0" ;
        oap:format               "native" ;
        oap:id-at-source         "2-s2.0-85099440322" ;
        oap:native               [ oap:field  [ oap:display-name  "Abstract" ;
                                                oap:name          "abstract" ;
                                                oap:text          "© 2021 A & WMA. Biosolarization is a fumigation alternative that combines solarization with organic amendments to suppress pests and pathogens in agricultural soils. The generation of volatile biopesticides in the soil, stemming from biodegradation of carbon-rich amendments, contributes to pest inactivation. The purpose of this study was to (1) profile volatiles that may contribute to pest control under field conditions and (2) measure volatile compounds that may present nuisance or exposure risks for humans near biosolarized fields where larger-scale anaerobic degradation of residues occurs. Biosolarization was performed using prominent agricultural waste products, hulls and shells from several almond varieties as soil amendments. After 8 days of biosolarization, soil samples were analyzed using solid phase microextraction-gas chromatography coupled to mass spectrometry. Volatile fatty acids and ketones made up 85% of biosolarized soil headspace, but terpenes, alcohols, aldehydes, esters, and sulfides were detected as well. Different almond variety residues produced distinct volatile profiles, and nonpareil-amended soils had a much richer and more diverse profile, as well as a fivefold greater VOC abundance, than pollinator-amended soil. Identified volatiles with low US recommended exposure limits were quantified via internal and external standards, including acetic acid, 2-butanone, butanal, hexanal, and phenylethyl alcohol. Across biosolarization treatments, headspace concentrations of selected compounds did not exceed 1 mg/m3. This study demonstrates that almond processing residues recycled into the soil as biosolarization substrates produce a high diversity of bioactive degradation compounds on a field scale, with low potential of non-target risks to humans. Implications: This manuscript has implications for two policy goals in the state of California: to reduce landfill disposal of organic waste, and to reduce emissions from soil fumigants. Almond hulls and shells are an increasing source of organic waste, and novel recycling strategies must be developed. Here, recycling almond residues as soil amendments promoted the rapid formation of VOCs which may act as alternatives to chemical fumigants. Headspace concentrations of potentially deleterious VOCs produced from treated soil were low, on the order of parts per billion. These results will help achieve policy goals by expanding waste usage and fumigation alternatives." ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "DOI" ;
                                                oap:links         [ oap:link  [ oap:href  "http://doi.org/10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "doi"
                                                                              ] ;
                                                                    oap:link  [ oap:href  "http://www.altmetric.com/details.php?doi=10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "altmetric"
                                                                              ]
                                                                  ] ;
                                                oap:name          "doi" ;
                                                oap:text          "10.1080/10962247.2020.1846637" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Issue" ;
                                                oap:name          "issue" ;
                                                oap:text          "3" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "External identifiers" ;
                                                oap:identifiers   [ oap:identifier  [ oap:field-value  "33320806" ;
                                                                                      oap:scheme       "pubmed"
                                                                                    ]
                                                                  ] ;
                                                oap:name          "external-identifiers" ;
                                                oap:type          "identifier-list"
                                              ] ;
                                   oap:field  [ oap:display-name  "Authors" ;
                                                oap:name          "authors" ;
                                                oap:people        [ oap:person  ( [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "Davis" ;
                                                                                                                                                       oap:type         "city"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "United States" ;
                                                                                                                                                       oap:type         "country"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "University of California, Davis" ;
                                                                                                                                                       oap:type         "organisation"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "E" ;
                                                                                    oap:identifiers           [ oap:identifier  [ oap:field-value  "57211201704" ;
                                                                                                                                  oap:scheme       "scopus-author-id"
                                                                                                                                ]
                                                                                                              ] ;
                                                                                    oap:initials              "E" ;
                                                                                    oap:last-name             "Shea" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "E" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "Davis" ;
                                                                                                                                                       oap:type         "city"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "United States" ;
                                                                                                                                                       oap:type         "country"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "University of California, Davis" ;
                                                                                                                                                       oap:type         "organisation"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "JD" ;
                                                                                    oap:identifiers           [ oap:identifier  [ oap:field-value  "16202681000" ;
                                                                                                                                  oap:scheme       "scopus-author-id"
                                                                                                                                ]
                                                                                                              ] ;
                                                                                    oap:initials              "JD" ;
                                                                                    oap:last-name             "Fernandez-Bayo" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "J" "D" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "United States" ;
                                                                                                                                                       oap:type         "country"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "Davis" ;
                                                                                                                                                       oap:type         "city"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "University of California, Davis" ;
                                                                                                                                                       oap:type         "organisation"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "AM" ;
                                                                                    oap:identifiers           [ oap:identifier  [ oap:field-value  "55955264900" ;
                                                                                                                                  oap:scheme       "scopus-author-id"
                                                                                                                                ]
                                                                                                              ] ;
                                                                                    oap:initials              "AM" ;
                                                                                    oap:last-name             "Pastrana" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "A" "M" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:addresses             [ oap:address  [ oap:grid              harvest_oap:grid.27860.3b ;
                                                                                                                               oap:iso-country-code  "US" ;
                                                                                                                               oap:line              [ oap:field-value  "Davis" ;
                                                                                                                                                       oap:type         "city"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "University of California, Davis" ;
                                                                                                                                                       oap:type         "organisation"
                                                                                                                                                     ] ;
                                                                                                                               oap:line              [ oap:field-value  "United States" ;
                                                                                                                                                       oap:type         "country"
                                                                                                                                                     ]
                                                                                                                             ]
                                                                                                              ] ;
                                                                                    oap:first-names           "CW" ;
                                                                                    oap:identifiers           [ oap:identifier  [ oap:field-value  "16032595600" ;
                                                                                                                                  oap:scheme       "scopus-author-id"
                                                                                                                                ]
                                                                                                              ] ;
                                                                                    oap:initials              "CW" ;
                                                                                    oap:last-name             "Simmons" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "C" "W" )
                                                                                                              ]
                                                                                  ]
                                                                                )
                                                                  ] ;
                                                oap:type          "person-list"
                                              ] ;
                                   oap:field  [ oap:display-name  "Pagination" ;
                                                oap:name          "pagination" ;
                                                oap:pagination    [ oap:begin-page  "400" ;
                                                                    oap:end-page    "412"
                                                                  ] ;
                                                oap:type          "pagination"
                                              ] ;
                                   oap:field  [ oap:display-name  "Title" ;
                                                oap:name          "title" ;
                                                oap:text          "Identification and evaluation of volatile organic compounds evolved during solarization with almond hull and shell amendments" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Journal" ;
                                                oap:name          "journal" ;
                                                oap:text          "Journal of the Air and Waste Management Association" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Status" ;
                                                oap:name          "publication-status" ;
                                                oap:text          "Published" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "ISSN" ;
                                                oap:links         [ oap:link  [ oap:href  "https://oapolicy.universityofcalifornia.edu:8002/elements-secure-api/v5.5/journals/1722858" ;
                                                                                oap:type  "elements/journal"
                                                                              ]
                                                                  ] ;
                                                oap:name          "issn" ;
                                                oap:text          "1096-2247" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "eISSN" ;
                                                oap:links         [ oap:link  [ oap:href  "https://oapolicy.universityofcalifornia.edu:8002/elements-secure-api/v5.5/journals/1722858" ;
                                                                                oap:type  "elements/journal"
                                                                              ]
                                                                  ] ;
                                                oap:name          "eissn" ;
                                                oap:text          "2162-2906" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:date          [ oap:day    "1" ;
                                                                    oap:month  "1" ;
                                                                    oap:year   "2021"
                                                                  ] ;
                                                oap:display-name  "Publication date" ;
                                                oap:name          "publication-date" ;
                                                oap:type          "date"
                                              ] ;
                                   oap:field  [ oap:display-name  "Volume" ;
                                                oap:name          "volume" ;
                                                oap:text          "71" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Sub types" ;
                                                oap:items         [ oap:item  "Journal Article" ] ;
                                                oap:name          "types" ;
                                                oap:type          "list"
                                              ]
                                 ] ;
        oap:source-display-name  "Scopus" ;
        oap:source-id            "7" ;
        oap:source-name          "scopus" .

harvest_oap:10508705  oap:format  "native" ;
        oap:id-at-source         "10.1080/10962247.2020.1846637" ;
        oap:native               [ oap:field  [ oap:display-name  "Status" ;
                                                oap:name          "publication-status" ;
                                                oap:text          "Published" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Title" ;
                                                oap:name          "title" ;
                                                oap:text          "Identification and evaluation of volatile organic compounds evolved during solarization with almond hull and shell amendments" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Volume" ;
                                                oap:name          "volume" ;
                                                oap:text          "71" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "eISSN" ;
                                                oap:links         [ oap:link  [ oap:href  "https://oapolicy.universityofcalifornia.edu:8002/elements-secure-api/v5.5/journals/1722858" ;
                                                                                oap:type  "elements/journal"
                                                                              ]
                                                                  ] ;
                                                oap:name          "eissn" ;
                                                oap:text          "2162-2906" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Publisher" ;
                                                oap:name          "publisher" ;
                                                oap:text          "Informa UK Limited" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:date          [ oap:day    "13" ;
                                                                    oap:month  "1" ;
                                                                    oap:year   "2021"
                                                                  ] ;
                                                oap:display-name  "Online publication date" ;
                                                oap:name          "online-publication-date" ;
                                                oap:type          "date"
                                              ] ;
                                   oap:field  [ oap:display-name  "Issue" ;
                                                oap:name          "issue" ;
                                                oap:text          "3" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Pagination" ;
                                                oap:name          "pagination" ;
                                                oap:pagination    [ oap:begin-page  "400" ;
                                                                    oap:end-page    "412"
                                                                  ] ;
                                                oap:type          "pagination"
                                              ] ;
                                   oap:field  [ oap:display-name  "Authors" ;
                                                oap:name          "authors" ;
                                                oap:people        [ oap:person  ( [ oap:first-names           "Emily" ;
                                                                                    oap:initials              "E" ;
                                                                                    oap:last-name             "Shea" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Emily" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:first-names           "Jesus D" ;
                                                                                    oap:initials              "JD" ;
                                                                                    oap:last-name             "Fernandez-Bayo" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Jesus" "D" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:first-names           "Ana M" ;
                                                                                    oap:initials              "AM" ;
                                                                                    oap:last-name             "Pastrana" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Ana" "M" )
                                                                                                              ]
                                                                                  ]
                                                                                  [ oap:first-names           "Christopher W" ;
                                                                                    oap:initials              "CW" ;
                                                                                    oap:last-name             "Simmons" ;
                                                                                    oap:separate-first-names  [ oap:first-name  ( "Christopher" "W" )
                                                                                                              ]
                                                                                  ]
                                                                                )
                                                                  ] ;
                                                oap:type          "person-list"
                                              ] ;
                                   oap:field  [ oap:date          [ oap:day    "15" ;
                                                                    oap:month  "12" ;
                                                                    oap:year   "2020"
                                                                  ] ;
                                                oap:display-name  "Record created at source" ;
                                                oap:name          "record-created-at-source-date" ;
                                                oap:type          "date"
                                              ] ;
                                   oap:field  [ oap:display-name  "ISSN" ;
                                                oap:links         [ oap:link  [ oap:href  "https://oapolicy.universityofcalifornia.edu:8002/elements-secure-api/v5.5/journals/1722858" ;
                                                                                oap:type  "elements/journal"
                                                                              ]
                                                                  ] ;
                                                oap:name          "issn" ;
                                                oap:text          "1096-2247" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Language" ;
                                                oap:name          "language" ;
                                                oap:text          "en" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "Journal" ;
                                                oap:name          "journal" ;
                                                oap:text          "Journal of the Air & Waste Management Association" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:display-name  "DOI" ;
                                                oap:links         [ oap:link  [ oap:href  "http://doi.org/10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "doi"
                                                                              ] ;
                                                                    oap:link  [ oap:href  "http://www.altmetric.com/details.php?doi=10.1080/10962247.2020.1846637" ;
                                                                                oap:type  "altmetric"
                                                                              ]
                                                                  ] ;
                                                oap:name          "doi" ;
                                                oap:text          "10.1080/10962247.2020.1846637" ;
                                                oap:type          "text"
                                              ] ;
                                   oap:field  [ oap:date          [ oap:day    "4" ;
                                                                    oap:month  "3" ;
                                                                    oap:year   "2021"
                                                                  ] ;
                                                oap:display-name  "Publication date" ;
                                                oap:name          "publication-date" ;
                                                oap:type          "date"
                                              ]
                                 ] ;
        oap:source-display-name  "Crossref" ;
        oap:source-id            "13" ;
        oap:source-name          "crossref" .
#+END_SRC
